<template>
  <Head>
    <title>Сравнить помол.</title>
  </Head>

  <div class='base-container'>
    <UIDropdown @select="(value) => {selectedGrinder = value }" :disabled="false" :options-array="grinderNames"  :title="'Выберите кофемолку'"></UIDropdown>
    <UIDropdown v-if="selectedGrinder" :disabled="false" @select="(value) => { grindSettingIndex = grindersArray[selectedGrinder].indexOf(value), console.log(value, grindersArray[selectedGrinder].indexOf(value) )}" :options-array="grindersArray[selectedGrinder]" :title="'Выберите помол'"></UIDropdown>
    <UIDropdown @select="(value) => {selectedSecondGrinder = value }" :disabled="false" :options-array="grinderNames"  :title="'Выберите вторую кофемолку'"></UIDropdown>
    <p class="par-1" v-if="selectedGrinder && selectedSecondGrinder && grindSettingIndex">
      {{ `Помол для ${selectedSecondGrinder}: ${grindersArray[selectedSecondGrinder][grindSettingIndex]}` }}
    </p>
  </div>
  <footer class="footer">
    <p class="par-6">Все расчеты принадлежат компании <a class="no-link-style" href="theweldercatherine.ru">Сварщица Екатерина</a> я просто привел их в интерактивный вид.</p>
    <p class="par-6">Создано Матвеем Климовским.</p>
  </footer>
</template>
<script lang='ts' setup>


const selectedGrinder = ref()
const selectedSecondGrinder = ref()
const grindSettingIndex = ref()



const grindersArray = 
  {
    "Mahlkönig EK43 (turkish) Диск 1-11": [
      5.0,
      5.5,
      6.0,
      6.5,
      7.0,
      7.5,
      8.0,
      8.5,
      9.0,
      9.5,
      10.0,
      10.5,
      11.0
    ],
    "Mahlkönig EK43(coff ee) Диск 1-11": [
      4.2,
      5.1,
      5.5,
      6.1,
      6.6,
      7.25,
      7.6,
      8.1,
      8.6,
      8.9,
      9.4,
      10.0,
      10.5
    ],
    "Mahlkönig EK43 (coffee) Диск 1-16": [
      3.0,
      5.0,
      6.0,
      7.1,
      7.9,
      8.9,
      9.8,
      10.2,
      11.1,
      11.5,
      12.5,
      12.9,
      13.5
    ],
    "Mahlkönig Tanzania Диск 0-9": [
      4.5,
      5.25,
      5.75,
      6.0,
      6.25,
      6.75,
      6.9,
      7.2,
      7.5,
      7.75,
      8.1,
      8.5,
      9.0
    ],
    "Mazzer ZM": [
      400,
      430,
      480,
      510,
      548,
      585,
      625,
      665,
      710,
      730,
      770,
      800,
      830
    ],
    "Comandant e (red clix)": [
      22,
      26,
      29,
      32,
      34,
      43,
      46,
      48,
      52,
      54,
      57,
      61,
      64
    ],
    "Feldgrind": [
      "1+4",
      "1+5",
      "1+6,5",
      "1+7,5",
      "1+9,5",
      "1+10,5",
      "1+12,9",
      "2+2,5",
      "2+4",
      "2+5,1",
      "2+7",
      "2+8",
      "2+9"
    ],
    "Kinu": [
      "2+1",
      "2+2,5",
      "2+5,5",
      "2+6,5",
      "2+9,5",
      "3+1,5",
      "3+4,5",
      "3+6,2",
      "3+9,2",
      "4+1",
      "4+3",
      "4+4",
      "4+5"
    ],
    "TIMEMORE": [
      "9-10",
      11,
      "13-14",
      14,
      15,
      16,
      17,
      "17-18",
      "18-19",
      19,
      "19-20",
      20,
      21
    ],
    "Baratza Encore": [
      "7-8",
      "9-10",
      10,
      11,
      12,
      13,
      14,
      15,
      "15-16",
      16,
      17,
      18,
      19
    ],
    "Baratza Virtuoso+": [
      "8-9",
      9,
      "10-11",
      "12-13",
      14,
      16,
      17,
      "18-19",
      "20-21",
      21,
      "22-23",
      "23-24",
      "24-25"
    ],
    "Baratza Forte": [
      "2H-2J",
      "2O",
      "3K",
      "3N-3O",
      "4F-4G",
      "4L",
      "4O",
      "5G-5H",
      "5L-5M",
      "5N-5O",
      "6D-6E",
      "6I-6J",
      "6N-6O"
    ],
    "Timemore Nano": [
      "10-11",
      "12-13",
      "14-15",
      "15-16",
      17,
      18,
      19,
      "19-20",
      21,
      22,
      23,
      24,
      25
    ],
    "Timemore Chestnut G1 Plus": [
      11,
      "12-13",
      14,
      15,
      "16-17",
      18,
      "19-20",
      "20-21",
      22,
      "23-24",
      "24-25",
      26,
      27
    ],
    "Timemore Chestnut C2": [
      11,
      13,
      "14-15",
      "15-16",
      17,
      18,
      19,
      "19-20",
      "20-21",
      21,
      22,
      23,
      25
    ],
    "1Zpresso JX": [
      "43-44",
      "49-50",
      "53-54",
      "56-57",
      "58-60",
      "63-66",
      "68-69",
      "69-71",
      "73-75",
      "75-76",
      "81-82",
      "83-85",
      "87-90"
    ],
    "Wilfa Svart Nymalt": [
      "3-4",
      "5-5,5",
      6.5,
      7.5,
      8.5,
      "10-11",
      "10-11",
      "11-11,5",
      12.5,
      "12,5-13",
      "13-13,5",
      "13,5-14",
      "-"
    ],
    "Eureka Atom Pro": [
      4.75,
      5.5,
      6.5,
      6.75,
      7.5,
      8.25,
      8.75,
      9.0,
      10.25,
      10.75,
      11.0,
      11.75,
      12.75
    ],
    "Eureka Drogheria": [
      2.25,
      2.75,
      3.25,
      3.75,
      4.25,
      4.75,
      5.25,
      5.5,
      6.25,
      6.5,
      7.25,
      7.5,
      8.0
    ],
    "Eureka Mignon жернова 50mm Filtro Pro": [
      "1й круг/5",
      "1й круг/ 5,5",
      "2й круг/ 0,5",
      "2й круг/1",
      "2й круг/ 1,5",
      "2й круг/ 2,75",
      "2й круг/ 3,25",
      "2й круг/ 3,75",
      "2й круг/ 4,5",
      "2й круг/ 4,75",
      "2й круг/ 5,5",
      "2й круг/ 5,75",
      "3й круг/ 0,75"
    ],
    "Eureka Mignon жернова 50mm Filtro Pro NEW": [
      "1й круг/ 4,75",
      "1й круг/ 5,75",
      "2й круг/ 0,75",
      "2й круг/ 1,25",
      "2й круг/ 1,75",
      "2й круг/ 2,25",
      "2й круг/3",
      "2й круг/ 3,25",
      "2й круг/ 3,75",
      "2й круг/4",
      "2й круг/5",
      "3й круг/0",
      "3й круг/1"
    ],
    "Feld 47": [
      "2 полных оборота + 1",
      "2 полных оборота + 3",
      "2 полных оборота + 4,5",
      "2 полных оборота + 5,5",
      "2 полных оборота + 8,5",
      "2 полных оборота + 10,75",
      "3 полных оборота + 1,25",
      "3 полных оборота + 3,25",
      "3 полных оборота + 6,25",
      "3 полных оборота + 7",
      "3 полных оборота + 8,5",
      "3 полных оборота + 10",
      "3 полных оборота + 11"
    ],
    "Ditting 807 LAB SWEET": [
      4.7,
      4.9,
      5.3,
      5.6,
      6.2,
      6.9,
      7.3,
      7.6,
      8.0,
      8.2,
      8.6,
      9.5,
      10.5
    ],
    "Fiorenzto F4 Filter": [
      1,
      "3-4",
      9,
      "12-13",
      16,
      "19-20",
      "23-24",
      "26-27",
      "32-34",
      "35-36",
      "43-44",
      "48-49",
      "-"
    ],
    "Omni Cup": [
      "21-22",
      26,
      "28-29",
      "31-32",
      "33-34",
      "36-38",
      "40-41",
      "42-43",
      46,
      "47-49",
      "51-52",
      "55-57",
      "60-65"
    ],
    "XEOLEO": [
      "1й круг/ 10",
      "0-0,5",
      "2й круг/ 2-2,5",
      "2й круг/ 3-3,5",
      "2й круг/ 5,25-6",
      "2й круг/ 6,25-7",
      "2й круг/ 8-8,75",
      "2й круг/ 9,25-10",
      "2й круг/ 10-10,5",
      "2й круг/ 11-0",
      "3й круг/ 1,25-1,5",
      "3й круг/ 2-2,5",
      "3й круг/ 2,5-3"
    ],
    "1Zpresso K-plus": [
      "43-44",
      "47-49",
      "53-54",
      "56-57",
      "60-61",
      "65-66",
      "69-70",
      "71-73",
      "76-78",
      "79-80",
      "85-86",
      "88-90",
      "93-95"
    ],
    "Mahlkönig VTA6S": [
      "5-6",
      "6-7",
      "7-8",
      "7-8",
      "8-9",
      "9-10",
      "9-10",
      "10-11",
      "11-12",
      "11-12",
      "≈12",
      "≈13",
      "≈13"
    ],
    "Saint Anthony": [
      "18-20",
      "21-23",
      "24-26",
      "27-29",
      "33-35",
      "36-38",
      "39-41",
      "42-45",
      "46-50",
      "51-55",
      "56-60",
      "-",
      "-"
    ],
    "DF64": [
      "25-30",
      "30-35",
      "35-40",
      "40-45",
      45,
      50,
      "51-55",
      55,
      60,
      "60-65",
      65,
      70,
      "70-75"
    ],
    "KINGrinde r K4": [
      "1й круг/ 50-59",
      "2й круг/ 0-9",
      "2й круг/ 10-19",
      "2й круг/ 20-25",
      "2й круг/ 26-30",
      "2й круг/ 31-40",
      "2й круг/ 41-50",
      "2й круг/ 51-60",
      "3й круг/ 51-60",
      "4й круг/ 01-10",
      "4й круг/ 11-20",
      "4й круг/ 21-30",
      "4й круг/ 31-40"
    ],
    "KINGrinde r K2-AR": [
      "2й круг/ 4-5",
      "2й круг/ 6-7",
      "2й круг/ 7-8",
      "2й круг/ 8-9",
      "2й круг/ 9-1",
      "3й круг/ 1-2",
      "3й круг/ 2-3",
      "3й круг/ 3-4",
      "3й круг/ 4-5",
      "3й круг/ 5-6",
      "3й круг/ 6-7",
      "3й круг/ 7-8",
      "3й круг/ 8-9"
    ],
    "1Zpresso Q2": [
      "39-41",
      "42-45",
      "46-48",
      "49-51",
      "52-54",
      "55-57",
      "58-60",
      "61-63",
      "64-66",
      "67-69",
      "70-72",
      "73-75",
      "76-78"
    ],
    "Timemore Chestnut C3": [
      "8-09",
      "10-11",
      "12-13",
      13,
      14,
      15,
      16,
      17,
      18,
      19,
      20,
      21,
      22
    ],
    "Comandante C40": [
      "13-14",
      "15-16",
      "17-18",
      "19-20",
      "20-21",
      "21-22",
      "22-23",
      "23-24",
      "24-25",
      "25-26",
      "26-27",
      29,
      31
    ],
    "Hario Coffee Grinder": [
      "5-07",
      "8-10",
      "11-13",
      "14-16",
      "17-19",
      "20-22",
      "23-25",
      "26-28",
      "29-31",
      "32-34",
      "35-37",
      "38-40",
      "38-40"
    ],
    "KINGrinder K6": [
      "1й оборот 55",
      "2й оборот 0",
      "2й оборот 10",
      "2й оборот 15",
      "2й оборот 20",
      "2й оборот 25",
      "2й оборот 30",
      "2й оборот 35",
      "2й оборот 40",
      "2й оборот 45",
      "2й оборот 50",
      "2й оборот 55",
      "3й оборот 0"
    ],
    "Timemore Chestnut x lite": [
      3,
      6,
      8,
      9,
      10,
      11,
      12,
      13,
      14,
      15,
      16,
      17,
      18
    ]
  }


  const grinderNames: string[] = Object.keys(grindersArray)
  


</script>


<style lang='scss' scoped>

.base-container {
  height: 80vh;
  display: grid;
  grid-template-columns: 1fr 1fr 1fr;
  gap: 2rem;
  box-sizing: border-box;
  padding: 2.4rem;
  
  @media (max-width: $media-tablet-s) {
    grid-template-columns: 1fr;
  }

}

.footer {
  display: flex;
  flex-direction: column;
  gap: 1.2rem;
  padding: 2.4rem;
  align-self: end;
}

.no-link-style {
  color: $blue-200;
}

</style>
